blog/myResume.org
#+STARTUP: showall
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+OPTIONS: html-postamble:nil
#+LANGUAGE: zh-CN
#+OPTIONS:   ^:{}
#+TITLE: 个人简历
#+TAGS: 
#+DATE: 2017-03-17
*** 联系方式
- Phone：18037105737（郑州电信）
- Email：peng_gy@163.com
- WeChat：xibolun
*** 自我介绍
- 彭甘雨/男/1992/河南南阳
- 本科/黄河科技学院/信息与计算科学专业
- 工作经验：3年
- 爱好：骑行、跑步、乒乓球、dota
*** 技能介绍
- 需求分析，需求文档编写；
- UML流程设计；
- 表结构设计(PowerDesigner)；
- Java:了解单点登陆，熟悉缓存配置，定时任务，SpringBoot的一些常规用法，事务模板、常用设计模式，myBaits，SpringDataJpa；
- 前端框架：熟练使用emberJs，reactJs；
- 数据库：熟练使用Mysql，Oracle；
- 部署发版：tomcat配置、nginx配置、项目工程部署；
- 项目规范：深刻认知项目规范的重要性，自己起草了公司的第一份开发规范，了解codeStyle，findBug等插件的使用；
- 代码管理：git,svn；gitlab使用；
*** 项目经验 
**** 杭州云霁科技有限公司（2015.05~至今）
***** 广发证券云平台项目（在做）（2016.03~至今）
- 项目背景：主要管理广发证券内部的主机资源，项目管理，计费功能；
- 使用技术：SpringBoot,SpringMVC,SpringWeb,SpringSecurity,SpringDataJpa,Mysql,Maven,Tomcat,ReactJs,代码生成工具；
- 主要负责：需求分析、表结构设计、环境搭建、登陆认证、定时任务配置、缓存配置、第三方接口对接、后端接口开发、前端开发、Java基础组件维护；
***** 恒丰银行金融云私有云项目（2016.03~2017.03）
- 项目背景：为恒丰银行数据中心打造自动化运维管理系统；恒丰内部各应用的蓝图关系梳理，自动化派单，可视化界面和流程；历时6个月，15人左右的团队，上线了人员管理系统、puppet配置管理系统、单点登陆系统、权限系统、包管理系统、cmdb系统、云管理平台系统，流程引擎；
- 主要使用技术：SpringBoot,SpringDataJpa,Mybaits,Mysql,MongoDB，emberJs,goJs,go,redis,puppet,swagger,Bpmn,Neo4j；
- 主要负责：权限系统开发、包管理系统开发、后期云管理平台需求开发及问题修改，发版，系统正常运行；成为此项目的两位核心之一；
***** 公司内部DevOps研发（2015.05~2015.08）
- 背景介绍：当时公司没有运维，部署比较艰难，写了一个一键发布的脚本，后来升级为使用jenkins调用包管理系统打包，上传yum源，自动安装rpm包；
- 主要使用技术：Jetty,SpringDataJpa,Apache Common CLI,JGit,Mysql,emberJs,BootStrap；
- 主要负责：自动将java工程文件打包成rpm包，并发布至yum源，自动将rpm安装部署至目标机器，前端开发；
- 了解RPM打包原理、yum包管理原理；
**** 中国软件与技术服务股份有限公司（2013.11~2015.05）
***** 金税三期（2014.06~2014.11）
- 项目背景：金税二期的升级，国家级项目，全国各省市的统一化税务系统，聚集国内神码，方欣，中软等各大公司的人才投入开发，主要有核心征管、个税、决策一包、二包等系统；
- 使用技术：中软swordJava框架，中软swordJs框架,weblogic,Oracle,MyEclipse10；
- 主要负责：核心征管当中的登记、优惠、申报、征收部分核心业务模块相关用例的开发；
- 见识到大团队的开发流程和规范，开发进度管理等，最终得到总公司总经理的赏识；
***** 税务相关项目（湖北省地税项目、河南网报项目等）
- 项目背景：地方税务局相关税务系统的开发；
- 使用技术：中软swordJava框架，中软swordJs框架,weblogic,Oracle,MyEclipse10；
- 主要负责：税务相关用例的开发、项目上线、项目后期的运维工作；
*** 感谢 
非常感谢您在百忙之中阅读 ，期待你的回复。
