blog/myResume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2017-03-18 Sat 10:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>个人简历</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="彭甘雨" />
</head>
<body>
<div id="content">
<h1 class="title">个人简历</h1>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">联系方式</h2>
<div class="outline-text-2" id="text-orgheadline1">
<ul class="org-ul">
<li>Phone：18037105737（郑州电信）</li>
<li>Email：peng_gy@163.com</li>
<li>WeChat：xibolun</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">自我介绍</h2>
<div class="outline-text-2" id="text-orgheadline2">
<ul class="org-ul">
<li>彭甘雨/男/1992/河南南阳</li>
<li>本科/黄河科技学院/信息与计算科学专业</li>
<li>工作经验：3年</li>
<li>爱好：骑行、跑步、乒乓球、dota</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">技能介绍</h2>
<div class="outline-text-2" id="text-orgheadline3">
<ul class="org-ul">
<li>需求分析，需求文档编写；</li>
<li>UML流程设计；</li>
<li>表结构设计(PowerDesigner)；</li>
<li>Java:了解单点登陆，熟悉缓存配置，定时任务，SpringBoot的一些常规用法，事务模板、常用设计模式，myBaits，SpringDataJpa；</li>
<li>前端框架：熟练使用emberJs，reactJs；</li>
<li>数据库：熟练使用Mysql，Oracle；</li>
<li>部署发版：tomcat配置、nginx配置、项目工程部署；</li>
<li>项目规范：深刻认知项目规范的重要性，自己起草了公司的第一份开发规范，了解codeStyle，findBug等插件的使用；</li>
<li>代码管理：git,svn；gitlab使用；</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11">项目经验</h2>
<div class="outline-text-2" id="text-orgheadline11">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">杭州云霁科技有限公司（2015.05~至今）</h3>
<div class="outline-text-3" id="text-orgheadline7">
</div><div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4">广发证券云平台项目（在做）（2016.03~至今）</h4>
<div class="outline-text-4" id="text-orgheadline4">
<ul class="org-ul">
<li>项目背景：主要管理广发证券内部的主机资源，项目管理，计费功能；</li>
<li>使用技术：SpringBoot,SpringMVC,SpringWeb,SpringSecurity,SpringDataJpa,Mysql,Maven,Tomcat,ReactJs,代码生成工具；</li>
<li>主要负责：需求分析、表结构设计、环境搭建、登陆认证、定时任务配置、缓存配置、第三方接口对接、后端接口开发、前端开发、Java基础组件维护；</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">恒丰银行金融云私有云项目（2016.03~2017.03）</h4>
<div class="outline-text-4" id="text-orgheadline5">
<ul class="org-ul">
<li>项目背景：为恒丰银行数据中心打造自动化运维管理系统；恒丰内部各应用的蓝图关系梳理，自动化派单，可视化界面和流程；历时6个月，15人左右的团队，上线了人员管理系统、puppet配置管理系统、单点登陆系统、权限系统、包管理系统、cmdb系统、云管理平台系统，流程引擎；</li>
<li>主要使用技术：SpringBoot,SpringDataJpa,Mybaits,Mysql,MongoDB，emberJs,goJs,go,redis,puppet,swagger,Bpmn,Neo4j；</li>
<li>主要负责：权限系统开发、包管理系统开发、后期云管理平台需求开发及问题修改，发版，系统正常运行；成为此项目的两位核心之一；</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">公司内部DevOps研发（2015.05~2015.08）</h4>
<div class="outline-text-4" id="text-orgheadline6">
<ul class="org-ul">
<li>背景介绍：当时公司没有运维，部署比较艰难，写了一个一键发布的脚本，后来升级为使用jenkins调用包管理系统打包，上传yum源，自动安装rpm包；</li>
<li>主要使用技术：Jetty,SpringDataJpa,Apache Common CLI,JGit,Mysql,emberJs,BootStrap；</li>
<li>主要负责：自动将java工程文件打包成rpm包，并发布至yum源，自动将rpm安装部署至目标机器，前端开发；</li>
<li>了解RPM打包原理、yum包管理原理；</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">中国软件与技术服务股份有限公司（2013.11~2015.05）</h3>
<div class="outline-text-3" id="text-orgheadline10">
</div><div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8">金税三期（2014.06~2014.11）</h4>
<div class="outline-text-4" id="text-orgheadline8">
<ul class="org-ul">
<li>项目背景：金税二期的升级，国家级项目，全国各省市的统一化税务系统，聚集国内神码，方欣，中软等各大公司的人才投入开发，主要有核心征管、个税、决策一包、二包等系统；</li>
<li>使用技术：中软swordJava框架，中软swordJs框架,weblogic,Oracle,MyEclipse10；</li>
<li>主要负责：核心征管当中的登记、优惠、申报、征收部分核心业务模块相关用例的开发；</li>
<li>见识到大团队的开发流程和规范，开发进度管理等，最终得到总公司总经理的赏识；</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9">税务相关项目（湖北省地税项目、河南网报项目等）</h4>
<div class="outline-text-4" id="text-orgheadline9">
<ul class="org-ul">
<li>项目背景：地方税务局相关税务系统的开发；</li>
<li>使用技术：中软swordJava框架，中软swordJs框架,weblogic,Oracle,MyEclipse10；</li>
<li>主要负责：税务相关用例的开发、项目上线、项目后期的运维工作；</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">感谢</h2>
<div class="outline-text-2" id="text-orgheadline12">
<p>
非常感谢您在百忙之中阅读 ，期待你的回复。
</p>
</div>
</div>
</div>
</body>
</html>
